facebookincubator/oculus-linux-kernel/drivers/staging/oculus/mcu/swd/swd_registers_nrf54h20.h
/* SPDX-License-Identifier: GPL-2.0 */
#ifndef _SWD_REGISTERS_NRF54H20_H
#define _SWD_REGISTERS_NRF54H20_H

/* CTRL-Access Port registers */
#define SWD_NRF54H20_APREG_RESET               0x000
#define SWD_NRF54H20_APREG_RESET_Reset         (1)
#define SWD_NRF54H20_APREG_RESET_NoReset       (0)

#define SWD_NRF54H20_APREG_MAILBOX_BOOTMODE    0x020
#define SWD_NRD45H20_APREG_MAILBOX_BOOTMODE_Normal         (0)
#define SWD_NRD45H20_APREG_MAILBOX_BOOTMODE_Rom            (1)
#define SWD_NRD45H20_APREG_MAILBOX_BOOTMODE_EraseAll       (2)
#define SWD_NRD45H20_APREG_MAILBOX_BOOTMODE_SafeOp         (0x10)
#define SWD_NRF54H20_APREG_MAILBOX_BOOTMODE_DebugWait      (4)
#define SWD_NRD45H20_APREG_MAILBOX_BOOTMODE_OpcodeMask     (0x0E)

#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS  0x038
#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS_stage_mask	(0xFF000000)
#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS_stage_shift	(24)
#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS_unset_stage_val	 (0x00)
#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS_sysrom_stage_val	 (0x01)
#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS_sdrom_stage_val	 (0x02)
#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS_suit_stage_val	 (0x0B)
#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS_ironside_stage_val (0x0C)
#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS_recovery_stage_val (0x0D)
#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS_fwver_mask	(0x003F8000)
#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS_fwver_shift	(15)
#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS_opcode_mask	(0x00007000)
#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS_opcode_shift	(12)
#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS_cmderr_mask	(0x00000E00)
#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS_cmderr_shift	(9)
#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS_booterr_mask	(0x000000FF)
#define SWD_NRF54H20_APREG_MAILBOX_BOOTSTATUS_booterr_shift	(0)

/* Access Ports */
#define SWD_NRF54H20_APSEL_APP_AHBAP       0x00
#define SWD_NRF54H20_APSEL_RAD_AHBAP       0x01
#define SWD_NRF54H20_APSEL_SDFW_AP         0x02
#define SWD_NRF54H20_APSEL_AUX_AHBAP       0x03
#define SWD_NRF54H20_APSEL_DEVICE_CTRLAP   0x04
#define SWD_NRF54H20_APSEL_CORESIGHT_APBAP 0x05

/* FICR Registers */
#define SWD_NRF54H20_FICR_APP_BASE         0x0FFFE000UL
#define SWD_NRF54H20_FICR_PART_OFFSET      0x054
#define SWD_NRF54H20_FICR_VARIANT_OFFSET   0x058

#define SWD_NRF54H20_FICR_PART (SWD_NRF54H20_FICR_APP_BASE + SWD_NRF54H20_FICR_PART_OFFSET)
#define SWD_NRF54H20_FICR_VARIANT (SWD_NRF54H20_FICR_APP_BASE + SWD_NRF54H20_FICR_VARIANT_OFFSET)

/* SDFW Identifiers */
#define SWD_NRF54H20_SDFW_APPLICATION_OWNER_ID (0x02)
#define SWD_NRF54H20_SDFW_RADIO_OWNER_ID       (0x03)
#define SWD_NRF54H20_SDFW_VERSION_SUIT         (0xF00)
#define SWD_NRF54H20_SDFW_VERSION_IRONSIDE     (0xF01)
#endif // _SWD_REGISTERS_NRF54H20_H
